In [43]:
import pandas as pd
import numpy as np

In [44]:
data=pd.read_csv('train.csv')

In [45]:
data.head()

,id,distance,taxi_type,months_of_activity,customer_score,customer_score_confidence,drop_location_type,ratings_given_by_cust,num_of_cancelled_trips,anon_var_1,anon_var_2,anon_var_3,sex,pricing_category
0,T0005891966,59.30,C,1.0,NaN,NaN,B,1.18625,0,NaN,50,71,Male,2
1,T0005902453,20.68,B,0.0,2.79222,C,B,1.91750,1,31.0,50,65,Male,2
2,T0005847289,64.83,B,1.0,2.97482,C,A,3.62125,0,65.0,49,84,Male,2
3,T0005741279,25.51,C,0.0,2.90334,A,B,4.76750,2,46.0,43,60,Female,3
4,T0005711058,20.16,D,6.0,2.62301,B,D,2.03875,0,NaN,52,71,Female,3

In [46]:
#Identify null values
print(data.isnull().sum())

id                               0
distance                         0
taxi_type                    12152
months_of_activity            3533
customer_score               12041
customer_score_confidence    12041
drop_location_type               0
ratings_given_by_cust            0
num_of_cancelled_trips           0
anon_var_1                   42419
anon_var_2                       0
anon_var_3                       0
sex                              0
pricing_category                 0
dtype: int64

In [47]:
data['taxi_type'].value_counts() # go with max or mean

B    18644
C    16827
A    13011
D    11348
E     7015
Name: taxi_type, dtype: int64

In [48]:
data['months_of_activity'].value_counts() #go with mean

10.0    25608
2.0      7012
3.0      6221
0.0      6152
5.0      5203
1.0      4932
4.0      4604
7.0      4432
6.0      4405
8.0      3785
9.0      3110
Name: months_of_activity, dtype: int64

In [49]:
data['customer_score'].value_counts() # go with average

2.78450    9
2.77447    9
2.69907    9
2.70697    9
2.70093    9
2.70370    9
2.87170    9
2.78285    9
2.78465    9
2.77256    9
2.81590    8
2.80728    8
2.60123    8
2.77371    8
3.08081    8
2.81827    8
2.71425    8
2.78127    8
2.77198    8
2.77664    8
2.77746    8
2.77651    8
2.77608    8
2.77869    8
2.81921    8
2.77571    8
2.81916    7
2.86221    7
2.74162    7
2.70731    7
          ..
2.54432    1
2.84545    1
3.00144    1
2.51220    1
2.21665    1
2.76896    1
2.95610    1
2.76010    1
3.01131    1
2.57420    1
3.15128    1
3.17243    1
2.63734    1
3.17516    1
2.42990    1
2.95223    1
2.09799    1
2.62206    1
3.20320    1
2.23802    1
2.87407    1
2.52021    1
2.88669    1
3.16177    1
2.70131    1
2.78730    1
3.01728    1
3.04421    1
2.66349    1
2.90963    1
Name: customer_score, Length: 42214, dtype: int64

In [50]:
 data['customer_score_confidence'].value_counts() # go with B

B    24148
C    21639
A    21169
Name: customer_score_confidence, dtype: int64

In [51]:
data.drop(columns=['anon_var_1','id'],inplace=True)

In [52]:
data.head()

,distance,taxi_type,months_of_activity,customer_score,customer_score_confidence,drop_location_type,ratings_given_by_cust,num_of_cancelled_trips,anon_var_2,anon_var_3,sex,pricing_category
0,59.30,C,1.0,NaN,NaN,B,1.18625,0,50,71,Male,2
1,20.68,B,0.0,2.79222,C,B,1.91750,1,50,65,Male,2
2,64.83,B,1.0,2.97482,C,A,3.62125,0,49,84,Male,2
3,25.51,C,0.0,2.90334,A,B,4.76750,2,43,60,Female,3
4,20.16,D,6.0,2.62301,B,D,2.03875,0,52,71,Female,3

In [53]:
values = {'taxi_type': 'B', 'customer_score_confidence': 'B'}
data.fillna(value=values,inplace=True)

In [54]:
#Identify null values
print(data.isnull().sum())

distance                         0
taxi_type                        0
months_of_activity            3533
customer_score               12041
customer_score_confidence        0
drop_location_type               0
ratings_given_by_cust            0
num_of_cancelled_trips           0
anon_var_2                       0
anon_var_3                       0
sex                              0
pricing_category                 0
dtype: int64

In [55]:
data['months_of_activity'] = data['months_of_activity'].fillna((data['months_of_activity'].median()))

In [56]:
data['customer_score'] = data['customer_score'].fillna((data['customer_score'].median()))

In [57]:
#Identify null values
print(data.isnull().sum())

distance                     0
taxi_type                    0
months_of_activity           0
customer_score               0
customer_score_confidence    0
drop_location_type           0
ratings_given_by_cust        0
num_of_cancelled_trips       0
anon_var_2                   0
anon_var_3                   0
sex                          0
pricing_category             0
dtype: int64

In [58]:
data['pricing_category'].value_counts()

2    34028
3    28586
1    16383
Name: pricing_category, dtype: int64

In [59]:
data.head()

,distance,taxi_type,months_of_activity,customer_score,customer_score_confidence,drop_location_type,ratings_given_by_cust,num_of_cancelled_trips,anon_var_2,anon_var_3,sex,pricing_category
0,59.30,C,1.0,2.796885,B,B,1.18625,0,50,71,Male,2
1,20.68,B,0.0,2.792220,C,B,1.91750,1,50,65,Male,2
2,64.83,B,1.0,2.974820,C,A,3.62125,0,49,84,Male,2
3,25.51,C,0.0,2.903340,A,B,4.76750,2,43,60,Female,3
4,20.16,D,6.0,2.623010,B,D,2.03875,0,52,71,Female,3

In [60]:
data.drop(columns='sex',inplace=True)

In [61]:
newDataFrame=data[['taxi_type','customer_score_confidence','drop_location_type']]

In [62]:
newDataFrame.head()

  taxi_type customer_score_confidence drop_location_type
0         C                         B                  B
1         B                         C                  B
2         B                         C                  A
3         C                         A                  B
4         D                         B                  D

In [63]:
data.drop(columns=['taxi_type','customer_score_confidence','drop_location_type'],inplace=True)

In [64]:
data.head()

,distance,months_of_activity,customer_score,ratings_given_by_cust,num_of_cancelled_trips,anon_var_2,anon_var_3,pricing_category
0,59.30,1.0,2.796885,1.18625,0,50,71,2
1,20.68,0.0,2.792220,1.91750,1,50,65,2
2,64.83,1.0,2.974820,3.62125,0,49,84,2
3,25.51,0.0,2.903340,4.76750,2,43,60,3
4,20.16,6.0,2.623010,2.03875,0,52,71,3

In [68]:
final_arr=data.values

In [69]:
for i in range(len(final_arr[0])-1):
    
    mean = np.mean(final_arr[:,i])
    std = np.std(final_arr[:,i])
    final_arr[:, i] = abs((mean - final_arr[:,i]) / std)

In [70]:
final_arr

array([[0.59107875, 1.41348214, 0.01858215, ..., 0.24080277, 0.35381468,
        2.        ],
       [0.92080859, 1.69541482, 0.04098689, ..., 0.24080277, 0.87126906,
        2.        ],
       [0.80756599, 1.41348214, 0.83599176, ..., 0.44098479, 0.76733647,
        2.        ],
       ...,
       [1.2171573 , 0.00381873, 0.70702961, ..., 0.6411668 , 1.04375385,
        2.        ],
       [0.76685229, 1.123912  , 0.01858215, ..., 0.04062075, 0.09508749,
        2.        ],
       [0.53794328, 1.123912  , 0.27415947, ..., 0.6411668 , 0.95751145,
        3.        ]])

In [71]:
final_arr[:,-1]

array([2., 2., 2., ..., 2., 2., 3.])

In [72]:
from sklearn import ensemble
from sklearn.ensemble import RandomForestClassifier
from sklearn.model_selection import train_test_split
import xgboost as xgb

In [73]:
y = final_arr[:,-1]

In [74]:
y

array([2., 2., 2., ..., 2., 2., 3.])

In [75]:
train = final_arr[:,:-1]

In [76]:
train.shape

(78997, 7)

In [77]:
x_train,x_test,y_train,y_test = train_test_split(train,y,random_state=0,test_size=0.25)

In [78]:
clf=RandomForestClassifier(n_estimators=100,criterion='gini',max_depth=10)

In [79]:
clf.fit(x_train,y_train)

RandomForestClassifier(bootstrap=True, class_weight=None, criterion='gini',
            max_depth=10, max_features='auto', max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, n_estimators=100, n_jobs=None,
            oob_score=False, random_state=None, verbose=0,
            warm_start=False)

In [80]:
ypred = clf.predict(x_test)

In [81]:
clf.score(x_test,y_test)

0.4747341772151899

In [224]:
test_data=pd.read_csv('test.csv')
test_data.head()

,id,distance,taxi_type,months_of_activity,customer_score,customer_score_confidence,drop_location_type,ratings_given_by_cust,num_of_cancelled_trips,anon_var_1,anon_var_2,anon_var_3,sex
0,T0005834792,36.30,C,5.0,NaN,NaN,B,2.37500,0,NaN,49,86,Female
1,T0005896349,22.56,NaN,5.0,2.80098,A,C,2.30875,0,NaN,51,67,Male
2,T0005775167,75.09,A,8.0,NaN,NaN,B,3.54000,0,NaN,49,65,Male
3,T0005776893,59.44,C,8.0,NaN,NaN,A,2.86500,2,68.0,53,86,Male
4,T0005801375,109.21,D,10.0,3.23056,B,A,2.70000,1,43.0,56,92,Female

In [225]:
#Identify null values
print(test_data.isnull().sum())

id                               0
distance                         0
taxi_type                     8058
months_of_activity            2387
customer_score                8152
customer_score_confidence     8152
drop_location_type               0
ratings_given_by_cust            0
num_of_cancelled_trips           0
anon_var_1                   28611
anon_var_2                       0
anon_var_3                       0
sex                              0
dtype: int64

In [226]:
test_data.drop(columns=['anon_var_1'],inplace=True)

In [227]:
values = {'taxi_type': 'B', 'customer_score_confidence': 'B'}
test_data.fillna(value=values,inplace=True)

In [228]:
#Identify null values
print(test_data.isnull().sum())

id                              0
distance                        0
taxi_type                       0
months_of_activity           2387
customer_score               8152
customer_score_confidence       0
drop_location_type              0
ratings_given_by_cust           0
num_of_cancelled_trips          0
anon_var_2                      0
anon_var_3                      0
sex                             0
dtype: int64

In [229]:
test_data['months_of_activity'] = test_data['months_of_activity'].fillna((test_data['months_of_activity'].median()))

In [230]:
test_data['customer_score'] = test_data['customer_score'].fillna((test_data['customer_score'].median()))

In [231]:
#Identify null values
print(test_data.isnull().sum())

id                           0
distance                     0
taxi_type                    0
months_of_activity           0
customer_score               0
customer_score_confidence    0
drop_location_type           0
ratings_given_by_cust        0
num_of_cancelled_trips       0
anon_var_2                   0
anon_var_3                   0
sex                          0
dtype: int64

In [232]:
test_data.head()

,id,distance,taxi_type,months_of_activity,customer_score,customer_score_confidence,drop_location_type,ratings_given_by_cust,num_of_cancelled_trips,anon_var_2,anon_var_3,sex
0,T0005834792,36.30,C,5.0,2.79985,B,B,2.37500,0,49,86,Female
1,T0005896349,22.56,B,5.0,2.80098,A,C,2.30875,0,51,67,Male
2,T0005775167,75.09,A,8.0,2.79985,B,B,3.54000,0,49,65,Male
3,T0005776893,59.44,C,8.0,2.79985,B,A,2.86500,2,53,86,Male
4,T0005801375,109.21,D,10.0,3.23056,B,A,2.70000,1,56,92,Female

In [233]:
tnewDataFrame=test_data[['taxi_type','customer_score_confidence','drop_location_type']]

In [234]:
test_data.drop(columns=['taxi_type','customer_score_confidence','drop_location_type'],inplace=True)

In [235]:
test_data.head()

,id,distance,months_of_activity,customer_score,ratings_given_by_cust,num_of_cancelled_trips,anon_var_2,anon_var_3,sex
0,T0005834792,36.30,5.0,2.79985,2.37500,0,49,86,Female
1,T0005896349,22.56,5.0,2.80098,2.30875,0,51,67,Male
2,T0005775167,75.09,8.0,2.79985,3.54000,0,49,65,Male
3,T0005776893,59.44,8.0,2.79985,2.86500,2,53,86,Male
4,T0005801375,109.21,10.0,3.23056,2.70000,1,56,92,Female

In [236]:
id_col=test_data['id']

In [237]:
test_data.drop(columns=['id','sex'],inplace=True)

In [238]:
test_data.head()

,distance,months_of_activity,customer_score,ratings_given_by_cust,num_of_cancelled_trips,anon_var_2,anon_var_3
0,36.30,5.0,2.79985,2.37500,0,49,86
1,22.56,5.0,2.80098,2.30875,0,51,67
2,75.09,8.0,2.79985,3.54000,0,49,65
3,59.44,8.0,2.79985,2.86500,2,53,86
4,109.21,10.0,3.23056,2.70000,1,56,92

In [239]:
test_arr_val=test_data.values

In [240]:
for i in range(len(test_arr_val[0])-1):
    
    mean = np.mean(test_arr_val[:,i])
    std = np.std(test_arr_val[:,i])
    test_arr_val[:, i] = abs((mean - test_arr_val[:,i]) / std)

In [241]:
test_arr_val

array([[3.09928195e-01, 2.87937481e-01, 1.28067058e-02, ...,
        7.51873724e-01, 4.42996601e-01, 8.60000000e+01],
       [8.48950816e-01, 2.87937481e-01, 7.34999102e-03, ...,
        7.51873724e-01, 4.07515170e-02, 6.70000000e+01],
       [1.21181034e+00, 5.59383851e-01, 1.28067058e-02, ...,
        7.51873724e-01, 4.42996601e-01, 6.50000000e+01],
       ...,
       [9.36041808e-01, 5.70377925e-01, 1.39688069e+00, ...,
        7.51873724e-01, 8.45241685e-01, 6.20000000e+01],
       [1.28754419e+00, 1.70013970e+00, 1.27461165e+00, ...,
        1.17346261e+00, 4.42996601e-01, 6.30000000e+01],
       [2.22002587e+00, 1.12426474e+00, 4.87569214e-01, ...,
        2.10794442e-01, 9.64861193e-01, 8.20000000e+01]])

In [242]:
test_dummies_taxi_type=pd.get_dummies(tnewDataFrame.taxi_type,prefix='T_')

In [243]:
tnewDataFrame=pd.concat([test_dummies_taxi_type,tnewDataFrame],axis='columns')

In [244]:
tnewDataFrame.drop(columns=['taxi_type'],inplace=True)

In [245]:
tnewDataFrame.head()

   T__A  T__B  T__C  T__D  T__E customer_score_confidence drop_location_type
0     0     0     1     0     0                         B                  B
1     0     1     0     0     0                         A                  C
2     1     0     0     0     0                         B                  B
3     0     0     1     0     0                         B                  A
4     0     0     0     1     0                         B                  A

In [246]:
test_customer_score_confidence=pd.get_dummies(tnewDataFrame.customer_score_confidence,prefix='csc_')

In [247]:
tnewDataFrame=pd.concat([test_customer_score_confidence,tnewDataFrame],axis='columns')

In [248]:
tnewDataFrame.drop(columns=['customer_score_confidence'],inplace=True)

In [249]:
tnewDataFrame.head()

   csc__A  csc__B  csc__C  T__A  T__B  T__C  T__D  T__E drop_location_type
0       0       1       0     0     0     1     0     0                  B
1       1       0       0     0     1     0     0     0                  C
2       0       1       0     1     0     0     0     0                  B
3       0       1       0     0     0     1     0     0                  A
4       0       1       0     0     0     0     1     0                  A

In [250]:
test_drop_location_type=pd.get_dummies(tnewDataFrame.drop_location_type,prefix='dlt_')

In [251]:
tnewDataFrame=pd.concat([test_drop_location_type,tnewDataFrame],axis='columns')

In [252]:
tnewDataFrame.drop(columns=['drop_location_type'],inplace=True)

In [253]:
tnewDataFrame.head()

,dlt__A,dlt__B,dlt__C,dlt__D,dlt__E,dlt__F,dlt__G,dlt__H,dlt__I,dlt__J,...,dlt__M,dlt__N,csc__A,csc__B,csc__C,T__A,T__B,T__C,T__D,T__E
0,0,1,0,0,0,0,0,0,0,0,...,0,0,0,1,0,0,0,1,0,0
1,0,0,1,0,0,0,0,0,0,0,...,0,0,1,0,0,0,1,0,0,0
2,0,1,0,0,0,0,0,0,0,0,...,0,0,0,1,0,1,0,0,0,0
3,1,0,0,0,0,0,0,0,0,0,...,0,0,0,1,0,0,0,1,0,0
4,1,0,0,0,0,0,0,0,0,0,...,0,0,0,1,0,0,0,0,1,0

In [254]:
test_arr_cat=tnewDataFrame.values

In [255]:
final_arr_test=np.column_stack([test_arr_cat, test_arr_val])

In [256]:
y_cap=clf.predict(final_arr_test)

In [257]:
y_cap.shape

(52665,)

In [258]:
# Write the predictions to a CSV file which we can submit to the competition.
submission = pd.DataFrame(
    {'id': id_col, 'pricing_category': y_cap},
    columns = ['id', 'pricing_category'])
submission.to_csv('submission.csv', index = False)

In [259]:
sub=pd.read_csv('submission.csv')

In [260]:
sub.shape

(52665, 2)

In [261]:
sub['pricing_category'] = sub['pricing_category'].astype(float)

In [262]:
sub.head()

            id  pricing_category
0  T0005834792               2.0
1  T0005896349               2.0
2  T0005775167               1.0
3  T0005776893               2.0
4  T0005801375               3.0

In [263]:
sub.to_csv('submission.csv',index=False)

In [264]:
sub=pd.read_csv('submission.csv')

In [265]:
sub.head()

            id  pricing_category
0  T0005834792               2.0
1  T0005896349               2.0
2  T0005775167               1.0
3  T0005776893               2.0
4  T0005801375               3.0

In [266]:
import xgboost as xgb

In [277]:
model=xgb.XGBClassifier( n_estimators=100, max_depth=10)
model.fit(x_train,y_train)

XGBClassifier(base_score=0.5, booster='gbtree', colsample_bylevel=1,
       colsample_bytree=1, gamma=0, learning_rate=0.1, max_delta_step=0,
       max_depth=10, min_child_weight=1, missing=None, n_estimators=100,
       n_jobs=1, nthread=None, objective='multi:softprob', random_state=0,
       reg_alpha=0, reg_lambda=1, scale_pos_weight=1, seed=None,
       silent=True, subsample=1)

In [278]:
model.score(x_test,y_test)

0.6802025316455697

In [279]:
y_cap_xgboost=model.predict(final_arr_test)

In [280]:
# Write the predictions to a CSV file which we can submit to the competition.
submission = pd.DataFrame(
    {'id': id_col, 'pricing_category': y_cap_xgboost},
    columns = ['id', 'pricing_category'])
submission.to_csv('submission.csv', index = False)

In [281]:
sub=pd.read_csv('submission.csv')

In [282]:
sub['pricing_category'] = sub['pricing_category'].astype(float)

In [283]:
sub.to_csv('submission.csv',index=False)

In [284]:
sub=pd.read_csv('submission.csv')

In [285]:
sub.head()

            id  pricing_category
0  T0005834792               2.0
1  T0005896349               2.0
2  T0005775167               1.0
3  T0005776893               2.0
4  T0005801375               3.0